# LightNode Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LightNode Members
LightNode Class Methods Properties See Also
---
The LightNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RenderNode.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAsset | Returns an an instance of an Asset object, which contains definitions of the content node.  (Inherited from ContentNode.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetTransform | A transformation matrix associated with the node.  (Inherited from ContentNode.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
| NodeName | A readable name of the output node.  (Inherited from RenderNode.) |

# See Also
LightNode Class
Autodesk.Revit.DB Namespace